heisenman/home-automation/edge/esp32s3-eth/sdkconfig.defaults
# Defaults applied on first `idf.py set-target esp32s3`. Edit sdkconfig (not this) for local tweaks.

CONFIG_IDF_TARGET="esp32s3"

# ── Bluetooth: NimBLE — observer (passive scan) + central (GATT history pull) ──
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
# (peripheral/broadcaster left off — we only scan and connect-out)
# BLE5 EXTENDED advertising scan: the Aranet radon sensor broadcasts via extended adv (mfr 0x0702).
# ext-scan ALSO delivers legacy advs (SwitchBot), so the one scan covers both. S3-ONLY: this flag is
# NOT set on the C6 fleet's sdkconfig, so ha_ble_scan's ext path (#if CONFIG_BT_NIMBLE_EXT_ADV) compiles
# only here and the C6 nodes keep their legacy scan unchanged. (aranet-radon-edge, 2026-07-08.)
CONFIG_BT_NIMBLE_EXT_ADV=y
# Host task builds history-relay JSON payloads on its stack during a pull:
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=6144

# ── Wired Ethernet via W5500 over SPI (the S3 has NO internal EMAC) ─────────────
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETH_SPI_ETHERNET_W5500=y

# ── Wi-Fi is the auto-fallback transport; it shares the 2.4 GHz radio with BLE → SW coexistence ──
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# ── Flash: keep the C6 node's 4MB layout (works on any S3 module ≥4MB; uses the first 4MB) ──
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# ── Partition table: custom A/B OTA layout (partitions.csv, same as the C6 node) ──
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── OTA rollback: bootloader auto-reverts to the last-good slot if a freshly-OTA'd ──
# app fails its self-test (it must call esp_ota_mark_app_valid_cancel_rollback()). Cable-
# flashed images are never in pending-verify state, so this is harmless for bench dev.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# OTA delivery is HTTP pull from the local server (cleartext on the LAN; air-gapped, no TLS).
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y

# ── Misc ────────────────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
# DEBUG (aranet-radon-edge): route the console to the USB-serial-JTAG so logs come out /dev/ttyACM0
# (default was UART0 — physical pins, invisible over USB). Lets us see the ext-scan bring-up on this
# S3 without a UART adapter. Harmless to keep; revert to UART default once radon is proven if desired.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
